exploration.org
#+TITLE: Emacs pPREPL exploration

* Objectives
- Come up with a model for REPL-driven development that:
  - Provides ~(break)~ that starts a new sub-REPL in given point and gives access to the local context.
  - Starts a new sub-REPL automatically when an error is encountered and behaves like ~(break)~ does, but additionally giving access to the error object.
  - Sub-REPLs nests and each level can be quit using ~:repl/quit~.
  - Is based on the socket REPL, simplicity and extensibility rather than behind-the-scene magic.
  - Gets out of the way: my screen is small and all I want to look at is my code. ~C-x C-e~ displays results inline like Cider does. Only when needed (such as when an error is thrown), the REPL is brought forwards (probably a split view code/REPL is best).
  - Works in unsaved buffers. This is really important, as I work in Org mode files in "zoomed-in" mode (~C-c '~ when in a source block opens it in a new buffer which doesn't get saved until we zoom out of it, at which point its contents update the original source block). Having to zoom out and save constantly is a big pain and should only happen once I'm happy with the code block as such.
  - Is a suitable setup for production processes and not only development.
  - Allows hot-code patching in production if absolutely necessary.

* Proof-of-concept

** Deps
#+begin_src clojure :tangle deps.edn
  {:paths ["src"]
   :aliases
   {:repl-server
    {:extra-paths ["dev"] ; This makes dev/user.clj to load.
     :extra-deps {mvxcvi/puget {:mvn/version "1.3.4"}}
     :exec-fn jakub-stastny.dev.repl.server/start-server
     :exec-args {:name "repl-server"
                 :port 5555
                 :accept jakub-stastny.dev.repl.server/repl
                 :server-daemon false}}}}
#+end_src

- *Ref:* [[https://clojure.org/guides/deps_and_cli#socket_repl][Deps and CLI guide: socket REPL]].
- [[https://github.com/clojure/clojure/blob/38524061dcb14c598c239be87184b3378ffc5bac/src/clj/clojure/main.clj#L368][clojure.main/repl]].

#+begin_src clojure :tangle dev/user.clj :mkdirp yes
  (ns user
    "This gets loaded automatically before the server starts."
    (:require [jakub-stastny.dev.repl :refer (upgrade-repl local-context break try-break ls)]))

  (defn start []
    (def app {:start-time (new java.util.Date)}) ; Or (System/currentTimeMillis)
    (println "Standard REPL started.")
    (println "Additional helpers: local-context & break.")
    (println)
    (println "app:" (pr-str app))
    (println)
    (upgrade-repl))

  (comment
    (start)
    app
    (let [a :top-level] (let [b :nested] (local-context)))
    ,*2
    (doseq [i [1 0]] (break) (/ 1 i))

    ;; ExceptionInfo with data.
    (throw (ex-info "Fuck this" {:cant-be-bothered true}))
    ,*e
    app
    (local-context)
    {:message (ex-message *e) :data (ex-data *e)}

    ;; Other exceptions.
    (conj {} 1)
    {:message (ex-message *e) :data (ex-data *e)}

    ; Get out of nested REPLs with exception context.
    :repl/quit
    ,)

#+end_src

** REPL server
#+begin_src clojure :tangle src/jakub_stastny/dev/repl/server.clj :mkdirp yes
  (ns jakub-stastny.dev.repl.server
    (:require [clojure.core.server :as s]))

  (defn repl []
    (clojure.main/repl
     :prompt #(print (str "host.socket.repl." (ns-name *ns*) "=> "))
     :init s/repl-init
     :read s/repl-read))

  (defn start-server [{:keys [port] :as opts}]
    (println (str "~ Starting socket REPL on port " port "."))
    (println (str "  Connect: rlwrap nc localhost " port))
    (println)
    (println      "Use *1 *2 *3 to get the last three values.")
    (println      "Use *e to get the last exception raised.")
    (println)
    (println      "Some clojure.repl fns: source apropos dir pst doc find-doc.")
    (println      "See https://clojuredocs.org/clojure.repl for a full reference.")
    (println)
    (println      "There's also javadoc from clojure.java.javadoc and pp & pprint from clojure.pprint.")
    (println)
    (println      "This is the base REPL, you'll probably want to upgrade it by running (start).")
    (println)

    ; We have to print the prompt or inf-clojure won't recognise the REPL server being ready.
    (future (s/start-server opts))
    (repl)

    ; Without this, :repl/quit or C-d won't exit the socket server.
    (System/exit 0))
#+end_src

*** TODO Recover from C-c
https://clojuredocs.org/clojure.repl/set-break-handler!

