doc/exploration.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-09 Sun 09:48 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs pPREPL exploration</title>
<meta name="author" content="Jakub Šťastný" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../assets/styles.css"/>
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs pPREPL exploration</h1>

<div id="outline-container-org64479f8" class="outline-2">
<h2 id="org64479f8"><span class="section-number-2">1.</span> Objectives</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Come up with a model for REPL-driven development that:
<ul class="org-ul">
<li>Provides <code>(break)</code> that starts a new sub-REPL in given point and gives access to the local context.</li>
<li>Starts a new sub-REPL automatically when an error is encountered and behaves like <code>(break)</code> does, but additionally giving access to the error object.</li>
<li>Sub-REPLs nests and each level can be quit using <code>:repl/quit</code>.</li>
<li>Is based on the socket REPL, simplicity and extensibility rather than behind-the-scene magic.</li>
<li>Gets out of the way: my screen is small and all I want to look at is my code. <code>C-x C-e</code> displays results inline like Cider does. Only when needed (such as when an error is thrown), the REPL is brought forwards (probably a split view code/REPL is best).</li>
<li>Works in unsaved buffers. This is really important, as I work in Org mode files in "zoomed-in" mode (<code>C-c '</code> when in a source block opens it in a new buffer which doesn't get saved until we zoom out of it, at which point its contents update the original source block). Having to zoom out and save constantly is a big pain and should only happen once I'm happy with the code block as such.</li>
<li>Is a suitable setup for production processes and not only development.</li>
<li>Allows hot-code patching in production if absolutely necessary.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3512ca5" class="outline-2">
<h2 id="org3512ca5"><span class="section-number-2">2.</span> Proof-of-concept</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org528e3f8" class="outline-3">
<h3 id="org528e3f8"><span class="section-number-3">2.1.</span> Deps</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-clojure">{<span class="org-clojure-keyword">:paths</span> [<span class="org-string">"src"</span>]
 <span class="org-clojure-keyword">:aliases</span>
 {<span class="org-clojure-keyword">:repl-server</span>
  {<span class="org-clojure-keyword">:extra-paths</span> [<span class="org-string">"dev"</span>] <span class="org-comment">; This makes dev/user.clj to load.</span>
   <span class="org-clojure-keyword">:extra-deps</span> {<span class="org-type">mvxcvi</span>/puget {<span class="org-clojure-keyword">:</span><span class="org-type">mvn</span><span class="org-default">/</span><span class="org-clojure-keyword">version</span> <span class="org-string">"1.3.4"</span>}}
   <span class="org-clojure-keyword">:exec-fn</span> <span class="org-type">jakub-stastny.dev.repl.server</span>/start-server
   <span class="org-clojure-keyword">:exec-args</span> {<span class="org-clojure-keyword">:name</span> <span class="org-string">"repl-server"</span>
               <span class="org-clojure-keyword">:port</span> 5555
               <span class="org-clojure-keyword">:accept</span> <span class="org-type">jakub-stastny.dev.repl.server</span>/repl
               <span class="org-clojure-keyword">:server-daemon</span> <span class="org-constant">false</span>}}}}
</pre>
</div>

<ul class="org-ul">
<li><b>Ref:</b> <a href="https://clojure.org/guides/deps_and_cli#socket_repl">Deps and CLI guide: socket REPL</a>.</li>
<li><a href="https://github.com/clojure/clojure/blob/38524061dcb14c598c239be87184b3378ffc5bac/src/clj/clojure/main.clj#L368">clojure.main/repl</a>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-clojure">(<span class="org-keyword">ns</span> <span class="org-type">user</span>
  <span class="org-doc">"This gets loaded automatically before the server starts."</span>
  (<span class="org-clojure-keyword">:require</span> [jakub-stastny.dev.repl <span class="org-clojure-keyword">:refer</span> (upgrade-repl local-context break try-break ls)]))

(<span class="org-keyword">defn</span> <span class="org-function-name">start</span> []
  (<span class="org-keyword">def</span> <span class="org-variable-name">app</span> {<span class="org-clojure-keyword">:start-time</span> (<span class="org-keyword">new</span> java.util.Date)}) <span class="org-comment">; Or (System/currentTimeMillis)</span>
  (println <span class="org-string">"Standard REPL started."</span>)
  (println <span class="org-string">"Additional helpers: local-context &amp; break."</span>)
  (println)
  (println <span class="org-string">"app:"</span> (pr-str app))
  (println)
  (upgrade-repl))

(<span class="org-keyword">comment</span>
  (start)
  app
  (<span class="org-keyword">let</span> [a <span class="org-clojure-keyword">:top-level</span>] (<span class="org-keyword">let</span> [b <span class="org-clojure-keyword">:nested</span>] (local-context)))
  <span class="org-builtin">*2</span>
  (<span class="org-keyword">doseq</span> [i [1 0]] (break) (/ 1 i))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">ExceptionInfo with data.</span>
  (<span class="org-keyword">throw</span> (ex-info <span class="org-string">"Fuck this"</span> {<span class="org-clojure-keyword">:cant-be-bothered</span> <span class="org-constant">true</span>}))
  <span class="org-builtin">*e</span>
  app
  (local-context)
  {<span class="org-clojure-keyword">:message</span> (ex-message <span class="org-builtin">*e</span>) <span class="org-clojure-keyword">:data</span> (ex-data <span class="org-builtin">*e</span>)}

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Other exceptions.</span>
  (conj {} 1)
  {<span class="org-clojure-keyword">:message</span> (ex-message <span class="org-builtin">*e</span>) <span class="org-clojure-keyword">:data</span> (ex-data <span class="org-builtin">*e</span>)}

  <span class="org-comment">; Get out of nested REPLs with exception context.</span>
  <span class="org-clojure-keyword">:</span><span class="org-type">repl</span><span class="org-default">/</span><span class="org-clojure-keyword">quit</span>
  ,)

</pre>
</div>
</div>
</div>

<div id="outline-container-org40176b4" class="outline-3">
<h3 id="org40176b4"><span class="section-number-3">2.2.</span> REPL server</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-clojure">(<span class="org-keyword">ns</span> <span class="org-type">jakub-stastny.dev.repl.server</span>
  (<span class="org-clojure-keyword">:require</span> [clojure.core.server <span class="org-clojure-keyword">:as</span> s]))

(<span class="org-keyword">defn</span> <span class="org-function-name">repl</span> []
  (<span class="org-type">clojure.main</span>/repl
   <span class="org-clojure-keyword">:prompt</span> #(print (str <span class="org-string">"host.socket.repl."</span> (ns-name <span class="org-builtin">*ns*</span>) <span class="org-string">"=&gt; "</span>))
   <span class="org-clojure-keyword">:init</span> <span class="org-type">s</span>/repl-init
   <span class="org-clojure-keyword">:read</span> <span class="org-type">s</span>/repl-read))

(<span class="org-keyword">defn</span> <span class="org-function-name">start-server</span> [{<span class="org-clojure-keyword">:keys</span> [port] <span class="org-clojure-keyword">:as</span> opts}]
  (println (str <span class="org-string">"~ Starting socket REPL on port "</span> port <span class="org-string">"."</span>))
  (println (str <span class="org-string">"  Connect: rlwrap nc localhost "</span> port))
  (println)
  (println      <span class="org-string">"Use *1 *2 *3 to get the last three values."</span>)
  (println      <span class="org-string">"Use *e to get the last exception raised."</span>)
  (println)
  (println      <span class="org-string">"Some clojure.repl fns: source apropos dir pst doc find-doc."</span>)
  (println      <span class="org-string">"See https://clojuredocs.org/clojure.repl for a full reference."</span>)
  (println)
  (println      <span class="org-string">"There's also javadoc from clojure.java.javadoc and pp &amp; pprint from clojure.pprint."</span>)
  (println)
  (println      <span class="org-string">"This is the base REPL, you'll probably want to upgrade it by running (start)."</span>)
  (println)

  <span class="org-comment">; We have to print the prompt or inf-clojure won't recognise the REPL server being ready.</span>
  (<span class="org-keyword">future</span> (<span class="org-type">s</span>/start-server opts))
  (repl)

  <span class="org-comment">; Without this, :repl/quit or C-d won't exit the socket server.</span>
  (<span class="org-type">System</span>/exit 0))
</pre>
</div>
</div>

<div id="outline-container-org4d2839f" class="outline-4">
<h4 id="org4d2839f"><span class="section-number-4">2.2.1.</span> <span class="todo TODO">TODO</span> Recover from C-c</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<a href="https://clojuredocs.org/clojure.repl/set-break-handler">https://clojuredocs.org/clojure.repl/set-break-handler</a>!
</p>
</div>
</div>
