exploration.org
*** TODO Upgrade to pREPL in ~(start)~

https://github.com/jackrusher/scimacs
https://github.com/borkdude/clj2el

#+begin_comment
Any exception starts a new subREPL with an informative prompt. I'm not yet certain I can make it aware of the local context say in (doseq [i [1 0]] (/ 1 i)), can I make it aware of the value of i at the point the exception was called? I hope it's possible :hand_with_index_and_middle_fingers_crossed: Anyhow this is useful only for the interactive mode (typing into the REPL), not really for the Emacs plugin, as starting subREPL means you have to switch to the REPL buffer and send :repl/quit in order to be able to continue in the original context and that'd get old very bloody fast.
#+end_comment

#+begin_src clojure :tangle src/jakub_stastny/dev/repl.clj :mkdirp yes
  (ns jakub-stastny.dev.repl
    (:require
     [clojure.string :as str]
     [clojure.core.server :as rs]
     [puget.printer :as puget]))

  (def colours {:red 31 :green 32 :yellow 33
              :blue 34 :purple 35 :cyan 36 :grey 37})

  (defn colour "Wraps text in ANSI colour escape sequence" [colour text]
    (if-let [colour-code (colours colour)]
      (str "\033[" colour-code "m" text "\033[0m") text))

  ; https://stackoverflow.com/questions/38183267/clojures-eval-does-not-see-local-symbols
  ; DOES &env get both a & b from (let [a :a] (let [b :b] (break))) ?
  (defmacro super-unsafe-eval
    "Like `eval`, but also exposes lexically-bound variables to eval. This
    is almost certainly a bad idea."
    [form]
    ;; (prn :SUE)
    ;; (prn :super-unsafe-eval `(eval (list 'let
    ;;                   ~(vec (mapcat #(vector `(quote ~%)
    ;;                                          `(list 'quote ~%))
    ;;                                 (keys &env)))
    ;;                   ~form)))
    `(eval (list 'let
               ~(vec (mapcat #(vector `(quote ~%)
                                      `(list 'quote ~%))
                             (keys &env)))
               ~form)))

  (defn super-unsafe-eval-wrapper [form] (super-unsafe-eval form))

  ; From The joy of Clojure
  (defn contextual-eval [ctx expr]
    ;; (prn :ctx-ev :ctx ctx :e expr) ; DBG
    ; IT DOESN'T KNOW HOW TO SERIALISE THIS:
    ; chunk_328 #object[clojure.lang.ArrayChunk 0x6428591a "clojure.lang.ArrayChunk@6428591a"]
    (prn :ctx-eval ; This won't work in CLJS I think.
      `(let [~@(mapcat (fn [[k v]] [k `'~v]) (filter (fn [[k v]] (not (.startsWith (str k) "chunk"))) ctx))]
          ~expr))
    (eval ; This won't work in CLJS I think.
      `(let [~@(mapcat (fn [[k v]] [k `'~v]) (filter (fn [[k v]] (not (.startsWith (str k) "chunk"))) ctx))]
          ~expr)))

  ; @phronmophobic:
  ; Instead of embedding the values, I would use eval to create a function and call it:
  ; You can also do something like save the values in a dynamic variable and then grab the values inside of the eval from the dynamic variable, but I think wrapping in a function is more explicit and less brittle.
  (defn contextual-eval-2 [ctx expr]
    (let [f
          (eval
           `(fn [~@(keys ctx)]
              ~expr))]
      (apply f (vals ctx))))

  (prn :ctx-evl-2 (contextual-eval-2 {'a (Exception. "hi") 'b 2}
                     '(str (.getMessage a) " " b)))

  ; TODO: map onto a command like "vars" or "ls".
  (defmacro local-context []
    ;; (prn :lc) ; DBG
    (let [symbols (keys &env)]
      ;; (prn :local-context &env :keys (keys &env)) ; DBG
      (zipmap (map (fn [sym] `(quote ~sym)) symbols) symbols)))

  ; Do NOT extract :eval into a method or the local-context will get lost.
  (defmacro break []
    `(do
       (clojure.main/repl
        :prompt #(print (colour :cyan "debug=> "))
        :read rs/repl-read
        :eval (partial contextual-eval-2 (local-context))
        :print prn ;; puget.pprint
        )))

  ;; (doseq [i [1 0]] (try-break (/ 1 i)))
  (defmacro try-break [expr]
    `(try ~expr (catch Exception ~'*e (break))))

  ; TODO: make this a command "ls" so we don't have to type "(ls)". This needs overriding read.
  (defmacro ls [] `(keys (local-context)))

  (def nesting-level (atom 0))

  (defn error-prompt [e]
    #(print (str
             (colour :red (last (str/split (str (type e)) #"\."))) "."
             (colour :green *ns*) "."
             (colour :cyan @nesting-level)
             (colour :yellow" λ "))))

  ;; repl-read respects :repl/quit
  (declare handle-error)
  (defmacro start-nested-repl [*e]
    `(do
       (println "Inspect *e for details about the error.")
       (clojure.main/repl
        :prompt (error-prompt ~'*e)
        :caught handle-error
        :eval (partial contextual-eval-2 (local-context))
        ;; :eval super-unsafe-eval-wrapper
        :read rs/repl-read
        :print prn ;; puget.pprint
        )))

  (defn handle-error [*e]
    (swap! nesting-level inc)
    (println (ex-message *e) (or (ex-data *e) ""))
    ;(prn :context (local-context)) ; e
    (start-nested-repl *e)
    (swap! nesting-level dec))

  (defn upgrade-init []
    ;; Here we might do some requires like Clojure does:
    ;; https://github.com/clojure/clojure/blob/master/src/clj/clojure/main.clj#L355
    ;; I've seen a better approach for :eval to wrap the whole code in (do (require...) (code)) so it's available anywhere, although that can easily lead to code that works only in the REPL.
    (rs/repl-init))

  ; This REPL is meant to be used as Pry in Ruby, not in Emacs, for that we will use pREPL later.
  (defn upgrade-repl []
    (clojure.main/repl
     :caught #'handle-error
     :prompt #(print (str (colour :green (ns-name *ns*)) (colour :cyan" λ ")))
     :print prn ; TODO pretty-print
     :init #'upgrade-init
     :read rs/repl-read))

  ;; FIXME: *e is missing.
  (comment
    (upgrade-repl)

    "value"
    ,*1

    ;; ExceptionInfo with data.
    (throw (ex-info "Fuck this" {:cant-be-bothered true}))
    (ex-data *e)
    (ex-message *e)

    ;; Other exceptions.
    (conj {} 1)
    (ex-data *e)
    (ex-message *e)

    :repl/quit
    ,)
#+end_src

