doc/exploration.html

<div id="outline-container-org3f82d30" class="outline-4">
<h4 id="org3f82d30"><span class="section-number-4">2.2.2.</span> <span class="todo TODO">TODO</span> Upgrade to pREPL in <code>(start)</code></h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
<a href="https://github.com/jackrusher/scimacs">https://github.com/jackrusher/scimacs</a>
<a href="https://github.com/borkdude/clj2el">https://github.com/borkdude/clj2el</a>
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span class="org-keyword">ns</span> <span class="org-type">jakub-stastny.dev.repl</span>
  (<span class="org-clojure-keyword">:require</span>
   [clojure.string <span class="org-clojure-keyword">:as</span> str]
   [clojure.core.server <span class="org-clojure-keyword">:as</span> rs]
   [puget.printer <span class="org-clojure-keyword">:as</span> puget]))

(<span class="org-keyword">def</span> <span class="org-variable-name">colours</span> {<span class="org-clojure-keyword">:red</span> 31 <span class="org-clojure-keyword">:green</span> 32 <span class="org-clojure-keyword">:yellow</span> 33
            <span class="org-clojure-keyword">:blue</span> 34 <span class="org-clojure-keyword">:purple</span> 35 <span class="org-clojure-keyword">:cyan</span> 36 <span class="org-clojure-keyword">:grey</span> 37})

(<span class="org-keyword">defn</span> <span class="org-function-name">colour</span> <span class="org-doc">"Wraps text in ANSI colour escape sequence"</span> [colour text]
  (<span class="org-keyword">if-let</span> [colour-code (colours colour)]
    (str <span class="org-string">"</span><span class="org-string"><span class="org-bold">\0</span></span><span class="org-string">33["</span> colour-code <span class="org-string">"m"</span> text <span class="org-string">"</span><span class="org-string"><span class="org-bold">\0</span></span><span class="org-string">33[0m"</span>) text))

<span class="org-comment-delimiter">; </span><span class="org-comment">https://stackoverflow.com/questions/38183267/clojures-eval-does-not-see-local-symbols</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">DOES &amp;env get both a &amp; b from (let [a :a] (let [b :b] (break))) ?</span>
(<span class="org-keyword">defmacro</span> <span class="org-function-name">super-unsafe-eval</span>
  <span class="org-doc">"Like `</span><span class="org-doc"><span class="org-constant">eval</span></span><span class="org-doc">`, but also exposes lexically-bound variables to eval. This</span>
<span class="org-doc">  is almost certainly a bad idea."</span>
  [form]
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(prn :SUE)</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(prn :super-unsafe-eval `(eval (list 'let</span>
  <span class="org-comment-delimiter">;;                   </span><span class="org-comment">~(vec (mapcat #(vector `(quote ~%)</span>
  <span class="org-comment-delimiter">;;                                          </span><span class="org-comment">`(list 'quote ~%))</span>
  <span class="org-comment-delimiter">;;                                 </span><span class="org-comment">(keys &amp;env)))</span>
  <span class="org-comment-delimiter">;;                   </span><span class="org-comment">~form)))</span>
  `(eval (list 'let
             ~(vec (mapcat #(vector `(<span class="org-keyword">quote</span> ~<span class="org-variable-name">%</span>)
                                    `(list 'quote ~<span class="org-variable-name">%</span>))
                           (keys &amp;env)))
             ~form)))

(<span class="org-keyword">defn</span> <span class="org-function-name">super-unsafe-eval-wrapper</span> [form] (super-unsafe-eval form))

<span class="org-comment-delimiter">; </span><span class="org-comment">From The joy of Clojure</span>
(<span class="org-keyword">defn</span> <span class="org-function-name">contextual-eval</span> [ctx expr]
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(prn :ctx-ev :ctx ctx :e expr) ; DBG</span>
  <span class="org-comment">; IT DOESN'T KNOW HOW TO SERIALISE THIS:</span>
  <span class="org-comment">; chunk_328 #object[clojure.lang.ArrayChunk 0x6428591a "clojure.lang.ArrayChunk@6428591a"]</span>
  (prn <span class="org-clojure-keyword">:ctx-eval</span> <span class="org-comment">; This won't work in CLJS I think.</span>
    `(<span class="org-keyword">let</span> [~@(mapcat (<span class="org-keyword">fn</span> [[k v]] [k `'~v]) (filter (<span class="org-keyword">fn</span> [[k v]] (not (.startsWith (str k) <span class="org-string">"chunk"</span>))) ctx))]
        ~expr))
  (eval <span class="org-comment">; This won't work in CLJS I think.</span>
    `(<span class="org-keyword">let</span> [~@(mapcat (<span class="org-keyword">fn</span> [[k v]] [k `'~v]) (filter (<span class="org-keyword">fn</span> [[k v]] (not (.startsWith (str k) <span class="org-string">"chunk"</span>))) ctx))]
        ~expr)))

<span class="org-comment-delimiter">; </span><span class="org-comment">@phronmophobic:</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">Instead of embedding the values, I would use eval to create a function and call it:</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">You can also do something like save the values in a dynamic variable and then grab the values inside of the eval from the dynamic variable, but I think wrapping in a function is more explicit and less brittle.</span>
(<span class="org-keyword">defn</span> <span class="org-function-name">contextual-eval-2</span> [ctx expr]
  (<span class="org-keyword">let</span> [f
        (eval
         `(<span class="org-keyword">fn</span> [~@(keys ctx)]
            ~expr))]
    (apply f (vals ctx))))

(prn <span class="org-clojure-keyword">:ctx-evl-2</span> (contextual-eval-2 {'a (Exception. <span class="org-string">"hi"</span>) 'b 2}
                   '(str (.getMessage a) <span class="org-string">" "</span> b)))

<span class="org-comment-delimiter">; </span><span class="org-comment">TODO: map onto a command like "vars" or "ls".</span>
(<span class="org-keyword">defmacro</span> <span class="org-function-name">local-context</span> []
  <span class="org-comment-delimiter">;; </span><span class="org-comment">(prn :lc) ; DBG</span>
  (<span class="org-keyword">let</span> [symbols (keys &amp;env)]
    <span class="org-comment-delimiter">;; </span><span class="org-comment">(prn :local-context &amp;env :keys (keys &amp;env)) ; DBG</span>
    (zipmap (map (<span class="org-keyword">fn</span> [sym] `(<span class="org-keyword">quote</span> ~sym)) symbols) symbols)))

<span class="org-comment-delimiter">; </span><span class="org-comment">Do NOT extract :eval into a method or the local-context will get lost.</span>
(<span class="org-keyword">defmacro</span> <span class="org-function-name">break</span> []
  `(<span class="org-keyword">do</span>
     (<span class="org-type">clojure.main</span>/repl
      <span class="org-clojure-keyword">:prompt</span> #(print (colour <span class="org-clojure-keyword">:cyan</span> <span class="org-string">"debug=&gt; "</span>))
      <span class="org-clojure-keyword">:read</span> <span class="org-type">rs</span>/repl-read
      <span class="org-clojure-keyword">:eval</span> (partial contextual-eval-2 (local-context))
      <span class="org-clojure-keyword">:print</span> prn <span class="org-comment-delimiter">;; </span><span class="org-comment">puget.pprint</span>
      )))

<span class="org-comment-delimiter">;; </span><span class="org-comment">(doseq [i [1 0]] (try-break (/ 1 i)))</span>
(<span class="org-keyword">defmacro</span> <span class="org-function-name">try-break</span> [expr]
  `(<span class="org-keyword">try</span> ~expr (<span class="org-keyword">catch</span> Exception ~'<span class="org-builtin">*e</span> (break))))

<span class="org-comment-delimiter">; </span><span class="org-comment">TODO: make this a command "ls" so we don't have to type "(ls)". This needs overriding read.</span>
(<span class="org-keyword">defmacro</span> <span class="org-function-name">ls</span> [] `(keys (local-context)))

(<span class="org-keyword">def</span> <span class="org-variable-name">nesting-level</span> (atom 0))

(<span class="org-keyword">defn</span> <span class="org-function-name">error-prompt</span> [e]
  #(print (str
           (colour <span class="org-clojure-keyword">:red</span> (last (<span class="org-type">str</span>/split (str (type e)) #<span class="org-string">"</span><span class="org-string"><span class="org-bold">\.</span></span><span class="org-string">"</span>))) <span class="org-string">"."</span>
           (colour <span class="org-clojure-keyword">:green</span> <span class="org-builtin">*ns*</span>) <span class="org-string">"."</span>
           (colour <span class="org-clojure-keyword">:cyan</span> @nesting-level)
           (colour <span class="org-clojure-keyword">:yellow</span><span class="org-string">" &#955; "</span>))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">repl-read respects :repl/quit</span>
(<span class="org-keyword">declare</span> handle-error)
(<span class="org-keyword">defmacro</span> <span class="org-function-name">start-nested-repl</span> [<span class="org-builtin">*e</span>]
  `(<span class="org-keyword">do</span>
     (println <span class="org-string">"Inspect *e for details about the error."</span>)
     (<span class="org-type">clojure.main</span>/repl
      <span class="org-clojure-keyword">:prompt</span> (error-prompt ~'<span class="org-builtin">*e</span>)
      <span class="org-clojure-keyword">:caught</span> handle-error
      <span class="org-clojure-keyword">:eval</span> (partial contextual-eval-2 (local-context))
      <span class="org-comment-delimiter">;; </span><span class="org-comment">:eval super-unsafe-eval-wrapper</span>
      <span class="org-clojure-keyword">:read</span> <span class="org-type">rs</span>/repl-read
      <span class="org-clojure-keyword">:print</span> prn <span class="org-comment-delimiter">;; </span><span class="org-comment">puget.pprint</span>
      )))

(<span class="org-keyword">defn</span> <span class="org-function-name">handle-error</span> [<span class="org-builtin">*e</span>]
  (swap! nesting-level inc)
  (println (ex-message <span class="org-builtin">*e</span>) (<span class="org-keyword">or</span> (ex-data <span class="org-builtin">*e</span>) <span class="org-string">""</span>))
  <span class="org-comment">;(prn :context (local-context)) ; e</span>
  (start-nested-repl <span class="org-builtin">*e</span>)
  (swap! nesting-level dec))

(<span class="org-keyword">defn</span> <span class="org-function-name">upgrade-init</span> []
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Here we might do some requires like Clojure does:</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">https://github.com/clojure/clojure/blob/master/src/clj/clojure/main.clj#L355</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">I've seen a better approach for :eval to wrap the whole code in (do (require...) (code)) so it's available anywhere, although that can easily lead to code that works only in the REPL.</span>
  (<span class="org-type">rs</span>/repl-init))

<span class="org-comment-delimiter">; </span><span class="org-comment">This REPL is meant to be used as Pry in Ruby, not in Emacs, for that we will use pREPL later.</span>
(<span class="org-keyword">defn</span> <span class="org-function-name">upgrade-repl</span> []
  (<span class="org-type">clojure.main</span>/repl
   <span class="org-clojure-keyword">:caught</span> #'handle-error
   <span class="org-clojure-keyword">:prompt</span> #(print (str (colour <span class="org-clojure-keyword">:green</span> (ns-name <span class="org-builtin">*ns*</span>)) (colour <span class="org-clojure-keyword">:cyan</span><span class="org-string">" &#955; "</span>)))
   <span class="org-clojure-keyword">:print</span> prn <span class="org-comment">; TODO pretty-print</span>
   <span class="org-clojure-keyword">:init</span> #'upgrade-init
   <span class="org-clojure-keyword">:read</span> <span class="org-type">rs</span>/repl-read))

<span class="org-comment-delimiter">;; </span><span class="org-comment">FIXME: *e is missing.</span>
(<span class="org-keyword">comment</span>
  (upgrade-repl)

  <span class="org-string">"value"</span>
  <span class="org-builtin">*1</span>

  <span class="org-comment-delimiter">;; </span><span class="org-comment">ExceptionInfo with data.</span>
  (<span class="org-keyword">throw</span> (ex-info <span class="org-string">"Fuck this"</span> {<span class="org-clojure-keyword">:cant-be-bothered</span> <span class="org-constant">true</span>}))
  (ex-data <span class="org-builtin">*e</span>)
  (ex-message <span class="org-builtin">*e</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Other exceptions.</span>
  (conj {} 1)
  (ex-data <span class="org-builtin">*e</span>)
  (ex-message <span class="org-builtin">*e</span>)

  <span class="org-clojure-keyword">:</span><span class="org-type">repl</span><span class="org-default">/</span><span class="org-clojure-keyword">quit</span>
  ,)
</pre>
</div>
</div>
</div>
</div>
