exploration.org
** Usage
#+begin_src sh
  clojure -X:repl-server
  clojure -X:repl-server :port 1234
#+end_src

** Emacs integration
*** Take I: ~inf-clojure~
#+begin_src emacs-lisp :tangle .dir-locals.el
  ((nil
    (inf-clojure-custom-startup . "clojure -X:repl-server :port %d")
    ;(inf-clojure-custom-startup . ("localhost" . 5555))
    (inf-clojure-custom-repl-type . clojure)))
#+end_src

- Doc [[https://github.com/clojure-emacs/inf-clojure#startup][inf-clojure#startup]].
- Source [[https://github.com/clojure-emacs/inf-clojure/blob/master/inf-clojure.el][inf-clojure.el]].

**** TODO How to load a whole buffer?
/Reloading a namespace (via require :reload/require :reload-all)/

**** ISSUE
- Wouldn't work in Org narrowed source window.

**** WORKAROUND
- Open [[./src/playground.clj]].
- Start the REPL using ~inf-clojure-socket-repl~.
- Close the file.
- Go back to the Org file and work as normal.

**** Outcome
- Inf-clojure doesn't behave the way I want, in particular it forces me to work in split view at all times.
- Additionally things were broken and took time to debug.

*** Discussion: why is there no Emacs pREPL?
It seems like the way to go, why isn't there a plugin?

Scenario: the main process has 2 REPLs running, a socket REPL and another pREPL for Cider-like thingy.

ACTUALLY: then I'd loose my nested REPL interface, I wouldn't even know what's been happening.

OR NOT? Like it'd work under the hood, but how would it behave?

It could report exceptions same way Cider does C-x C-e at which point you open side-by-side and debug.

Of course it'd have to pretty-print it, not show the "real" {:tag ...} communication.

You could tweak what inf-clojure sends and that'd do. It'd still show the whole {:tag ...} thingy on receive, but whatevs.

*** Stepping stone: find or make a nice & easy to use client for the socket REPL
- Something like Pry in Ruby.
- Start with plain socket REPL, upgrade to pREPL.
- Show ~out~ in colours with ~=> ...~, distinguish ~out~.
- SubREPL for ~err~.
- Rescue from ~System/exit~.
- Copy and paste from Emacs ~:'(~.
  - We need something like ~copy-last-sexp~, ~copy-parent-form~ and ~copy-buffer~.

**** TODO Verify it can run say ~clojure.inspector/inspect-tree~
**** TODO What if you run the client out of Emacs
Just send the forms to it. Shell in Emacs is pain and there are no colours (pretty-printing).

That client would then have to communicate over a socket with Emacs (would be client/server at the same time).

Or make the server pretty-print? Like if you don't care, here's your Emacs buffer, if it sucks to read, just try to read it in the console where the server prints it?

YEAH TOTALLY, let the server do it (unless in production).

EXCEPT the server provides UNUPGRADED REPL only!

*** Take II: custom Emacs plugin
**** Resources
- Emacs EDN parser [[https://github.com/clojure-emacs/parseedn][parseedn]].
- https://tonsky.me/blog/clojure-sublimed-3/
- [[https://github.com/Olical/propel][propel]].
- [[https://oli.me.uk/clojure-socket-prepl-cookbook/][Clojure socket pREPL cookbook]].
- [[https://blog.jakubholy.net/how-to-use-clojure-1.10-prepl/][How to use Clojure pREPL]].

**** Architecture
- Start a normal socket REPL, upgrade to pREPL at the beginning of the client session.
