doc/exploration.html

<div id="outline-container-org3873c7c" class="outline-3">
<h3 id="org3873c7c"><span class="section-number-3">2.3.</span> Usage</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-sh">clojure -X:repl-server
clojure -X:repl-server :port 1234
</pre>
</div>
</div>
</div>

<div id="outline-container-org3adcb90" class="outline-3">
<h3 id="org3adcb90"><span class="section-number-3">2.4.</span> Emacs integration</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org343c853" class="outline-4">
<h4 id="org343c853"><span class="section-number-4">2.4.1.</span> Take I: <code>inf-clojure</code></h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">((nil
  (inf-clojure-custom-startup . <span class="org-string">"clojure -X:repl-server :port %d"</span>)
  <span class="org-comment-delimiter">;</span><span class="org-comment">(inf-clojure-custom-startup . ("localhost" . 5555))</span>
  (inf-clojure-custom-repl-type . clojure)))
</pre>
</div>

<ul class="org-ul">
<li>Doc <a href="https://github.com/clojure-emacs/inf-clojure#startup">inf-clojure#startup</a>.</li>
<li>Source <a href="https://github.com/clojure-emacs/inf-clojure/blob/master/inf-clojure.el">inf-clojure.el</a>.</li>
</ul>
</div>

<div id="outline-container-org95ed848" class="outline-5">
<h5 id="org95ed848"><span class="section-number-5">2.4.1.1.</span> <span class="todo TODO">TODO</span> How to load a whole buffer?</h5>
<div class="outline-text-5" id="text-2-4-1-1">
<p>
<i>Reloading a namespace (via require :reload/require :reload-all)</i>
</p>
</div>
</div>

<div id="outline-container-orgf137896" class="outline-5">
<h5 id="orgf137896"><span class="section-number-5">2.4.1.2.</span> ISSUE</h5>
<div class="outline-text-5" id="text-2-4-1-2">
<ul class="org-ul">
<li>Wouldn't work in Org narrowed source window.</li>
</ul>
</div>
</div>

<div id="outline-container-org879b013" class="outline-5">
<h5 id="org879b013"><span class="section-number-5">2.4.1.3.</span> WORKAROUND</h5>
<div class="outline-text-5" id="text-2-4-1-3">
<ul class="org-ul">
<li>Open <a href="./src/playground.clj">./src/playground.clj</a>.</li>
<li>Start the REPL using <code>inf-clojure-socket-repl</code>.</li>
<li>Close the file.</li>
<li>Go back to the Org file and work as normal.</li>
</ul>
</div>
</div>

<div id="outline-container-org18efa95" class="outline-5">
<h5 id="org18efa95"><span class="section-number-5">2.4.1.4.</span> Outcome</h5>
<div class="outline-text-5" id="text-2-4-1-4">
<ul class="org-ul">
<li>Inf-clojure doesn't behave the way I want, in particular it forces me to work in split view at all times.</li>
<li>Additionally things were broken and took time to debug.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb54b57c" class="outline-4">
<h4 id="orgb54b57c"><span class="section-number-4">2.4.2.</span> Discussion: why is there no Emacs pREPL?</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
It seems like the way to go, why isn't there a plugin?
</p>

<p>
Scenario: the main process has 2 REPLs running, a socket REPL and another pREPL for Cider-like thingy.
</p>

<p>
ACTUALLY: then I'd loose my nested REPL interface, I wouldn't even know what's been happening.
</p>

<p>
OR NOT? Like it'd work under the hood, but how would it behave?
</p>

<p>
It could report exceptions same way Cider does C-x C-e at which point you open side-by-side and debug.
</p>

<p>
Of course it'd have to pretty-print it, not show the "real" {:tag &#x2026;} communication.
</p>

<p>
You could tweak what inf-clojure sends and that'd do. It'd still show the whole {:tag &#x2026;} thingy on receive, but whatevs.
</p>
</div>
</div>

<div id="outline-container-org99da348" class="outline-4">
<h4 id="org99da348"><span class="section-number-4">2.4.3.</span> Stepping stone: find or make a nice &amp; easy to use client for the socket REPL</h4>
<div class="outline-text-4" id="text-2-4-3">
<ul class="org-ul">
<li>Something like Pry in Ruby.</li>
<li>Start with plain socket REPL, upgrade to pREPL.</li>
<li>Show <code>out</code> in colours with <code>=&gt; ...</code>, distinguish <code>out</code>.</li>
<li>SubREPL for <code>err</code>.</li>
<li>Rescue from <code>System/exit</code>.</li>
<li>Copy and paste from Emacs <code>:'(</code>.
<ul class="org-ul">
<li>We need something like <code>copy-last-sexp</code>, <code>copy-parent-form</code> and <code>copy-buffer</code>.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-orga6f1f4b" class="outline-5">
<h5 id="orga6f1f4b"><span class="section-number-5">2.4.3.1.</span> <span class="todo TODO">TODO</span> Verify it can run say <code>clojure.inspector/inspect-tree</code></h5>
</div>
<div id="outline-container-orgf99e631" class="outline-5">
<h5 id="orgf99e631"><span class="section-number-5">2.4.3.2.</span> <span class="todo TODO">TODO</span> What if you run the client out of Emacs</h5>
<div class="outline-text-5" id="text-2-4-3-2">
<p>
Just send the forms to it. Shell in Emacs is pain and there are no colours (pretty-printing).
</p>

<p>
That client would then have to communicate over a socket with Emacs (would be client/server at the same time).
</p>

<p>
Or make the server pretty-print? Like if you don't care, here's your Emacs buffer, if it sucks to read, just try to read it in the console where the server prints it?
</p>

<p>
YEAH TOTALLY, let the server do it (unless in production).
</p>

<p>
EXCEPT the server provides UNUPGRADED REPL only!
</p>
</div>
</div>
</div>

<div id="outline-container-org0e414d6" class="outline-4">
<h4 id="org0e414d6"><span class="section-number-4">2.4.4.</span> Take II: custom Emacs plugin</h4>
<div class="outline-text-4" id="text-2-4-4">
</div>
<div id="outline-container-org05d48ac" class="outline-5">
<h5 id="org05d48ac"><span class="section-number-5">2.4.4.1.</span> Resources</h5>
<div class="outline-text-5" id="text-2-4-4-1">
<ul class="org-ul">
<li>Emacs EDN parser <a href="https://github.com/clojure-emacs/parseedn">parseedn</a>.</li>
<li><a href="https://tonsky.me/blog/clojure-sublimed-3/">https://tonsky.me/blog/clojure-sublimed-3/</a></li>
<li><a href="https://github.com/Olical/propel">propel</a>.</li>
<li><a href="https://oli.me.uk/clojure-socket-prepl-cookbook/">Clojure socket pREPL cookbook</a>.</li>
<li><a href="https://blog.jakubholy.net/how-to-use-clojure-1.10-prepl/">How to use Clojure pREPL</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-org9f82739" class="outline-5">
<h5 id="org9f82739"><span class="section-number-5">2.4.4.2.</span> Architecture</h5>
<div class="outline-text-5" id="text-2-4-4-2">
<ul class="org-ul">
<li>Start a normal socket REPL, upgrade to pREPL at the beginning of the client session.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>